# EndJoinCutback Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EndJoinCutback Property
ParameterTypeId Class See Also
---
"End Join Cutback"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EndJoinCutback { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EndJoinCutback As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EndJoinCutback {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace